/************************************************************************************
Copyright,  LCE STUDIO  
程序名称：串口1通讯函数（晶振频率18.432MHz）  
功能说明: 串口1初始化,字符发送与字符串发送函数,波特率9600bps
程序版本：1.0 （2014/06）
阿里旺旺：rob1983
淘宝店铺：http://shop67639654.taobao.com 
************************************************************************************/ 

#include "iap15w4k58s4.h"
#include "intrins.h"

void SendData(unsigned char ch);
void SendString(char *s);
void UartInit(void);

/*----------------------------
串口初始化
----------------------------*/

void UartInit(void)		//115200bps@12.000MHz
{
	SCON = 0x50;		//8位数据,可变波特率
	AUXR |= 0x40;		//定时器1时钟为Fosc,即1T
	AUXR &= 0xFE;		//串口1选择定时器1为波特率发生器
	TMOD &= 0x0F;		//设定定时器1为16位自动重装方式
	TL1 = 0xE6;		//设定定时初值
	TH1 = 0xFF;		//设定定时初值
	ET1 = 0;		//禁止定时器1中断
	TR1 = 1;		//启动定时器1
}



/*----------------------------
发送串口数据
----------------------------*/
void SendData(char ch)
{
    SBUF = ch;                 //写数据到UART数据寄存器
		while(TI == 0);
		TI = 0;
}

/*----------------------------
发送字符串
----------------------------*/
void SendString(char *s)
{
    while (*s)                  //检测字符串结束标志
    {
        SendData(*s++);         //发送当前字符
    }
}


